#+TITLE: Literární adminování
#+AUTHOR: Kepi
#+DATE: 2018-10-06
#+OPTIONS: toc:nil reveal_control:nil reveal_history:t num:nil date:nil reveal_title_slide:"<h2>%t</h2><h3>%a</h3><p>%d</p>" reveal_single_file:nil
#+REVEAL_HLEVEL: 2
#+REVEAL_THEME: solarized
#+REVEAL_THEME: moon
#+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js@3.7.0/
#+REVEAL_EXTRA_CSS: https://use.fontawesome.com/releases/v5.3.1/css/all.css
#+REVEAL_EXTRA_CSS: ./linuxdays/custom.css
#+REVEAL_TRANS: cube
#+REVEAL_MARGIN: 0.1


** Org Babel
:PROPERTIES:
:CUSTOM_ID: org-babel
:reveal_background: ./linuxdays/bg_babel_tower.jpg
:reveal_background_trans: slide
:END:

#+BEGIN_EXAMPLE
#+BEGIN_SRC sh :dir /boot/efi/EFI :results table
for i in $(ls); do
    echo $i
done
#+END_SRC

#+RESULTS:
| BOOT   |
| debian |
| grub   |
#+END_EXAMPLE

